/*************************************************************************
	> 题目要求: 给定三个小于100的正整数，求它们的乘积
	> 输入: 一行三个整数abc（1 <= a,b,c <= 100）
	> 输出: 一个整数表示三个数的乘积
 ************************************************************************/


#define _CRT_SECURE_NO_WARNINGS //如果你是在visual studio里运行此代码，请务必在文件开头添加宏定义来禁用警告，但这并不是最佳实践
#include <stdio.h>

int main() {
	int a, b, c; // 在声明变量 a, b, c 时，计算机会在栈(stack)内存上为这三个变量分配空间。
	scanf("%d%d%d", &a, &b, &c); // "%d%d%d"：格式字符串，表示读取三个整数。
	printf("%d\n", a * b * c); // &a, &b, &c：变量的地址（使用 & 符号表示）。scanf 需要知道读取的整数存储到哪里，所以需要传入变量的地址。
	return 0;
}


