/*************************************************************************
	> 题目要求: 给定一个三位数的整数，分别输出它的百位数，十位数和个位数
	> 输入: 一个整数（100 <= a <= 999）
	> 输出: 第一行，第二行，第三行分别是a的百位数，十位数和个位数

	除法（/）和取模（%）运算用于从一个整数中提取各个位数。
	除法运算通过丢弃小数部分来获取整数的高位数字。
	取模运算通过获取余数来获取整数的低位数字

// 以下是第二种解决方式：
int main() {
	char s[10]; // char 类型用于表示字符。s 是一个可以存储10个字符的数组。
	// scanf 函数等待用户输入一个字符串，输入的字符串不能包含空白字符（空格、换行符、制表符等）。
	scanf("%s", s); //"%s"：格式字符串，表示读取一个字符串，s：字符数组 s 的地址。数组名 s 作为参数传递时，会被解释为指向数组第一个元素的指针。
	// s[0], s[1], s[2] 分别访问数组 s 的第0个、第1个和第2个元素
	printf("%c\n%c\n%c\n", s[0], s[1], s[2]); // 这些元素的地址是连续的，分别为 s 开始地址，加1字节，加2字节，加3字节。
	return 0;
}
 ************************************************************************/

#define _CRT_SECURE_NO_WARNINGS //如果你是在visual studio里运行此代码，请务必在文件开头添加宏定义来禁用警告，但这并不是最佳实践
#include<stdio.h>

int main() {
	int a;
	scanf("%d", &a);
	int bai, shi, ge;
	bai = a / 100; //整除运算，去掉个位和十位数字，只保留百位及以上的数字。如果a=345，则 a / 100 为 3。
	shi = a % 100 / 10; //取模运算，得到 a 的后两位数字。如果 a=345，则 a % 100 = 45， 45 / 10 = 4
	ge = a % 10; //取模运算，得到 a 的个位数字。例 345 % 10 = 5
	printf("%d\n%d\n%d\n", bai, shi, ge);
	return 0;
}

