/*************************************************************************
	> sscanf 函数用于从字符串中读取格式化数据。它的功能类似于 scanf，但 sscanf 是从给定的字符串中读取数据，而不是从标准输入读取。
	> 语法: int sscanf(const char *str, const char *format, ...); 
	> str：指向要读取数据的字符串。format：格式字符串，指定要读取的数据的格式。...：指向接收读取数据的变量地址。
	> 返回值: 成功读取并转换的项数. 如果没有成功读取任何项，则返回0。如果发生读取错误或到达字符串末尾，则返回 EOF。
	> sscanf 的使用场景: 从输入字符串中提取数据。例如，从文件内容、网络数据或用户输入中解析数据。

	> sprintf 函数用于将格式化的数据写入字符串。它的功能类似于 printf，但 sprintf 是将格式化的数据写入字符串，而不是输出到标准输出。
	> 语法: int sprintf(char *str, const char *format, ...);
	> str：指向存储格式化数据的目标字符串。format：格式字符串，指定要写入的数据的格式。...：要格式化并写入字符串的数据。
	> 返回值: 成功写入字符串的字符数（不包括结尾的空字符）。
	> sprintf 的使用场景: 将多个变量的值格式化为一个字符串。例如，生成日志消息、输出报告或构建动态SQL查询。

	示例运行步骤：
	1. 字符数组 s 初始化为字符串 "123 456 789"。
	2. sscanf(s, "%d%d%d", &a, &b, &c); 从字符串 s 中解析出三个整数，分别存储在 a, b, 和 c 中。
	3. printf("a = %d, b = %d, c = %d\n", a, b, c); 输出解析后的整数 a, b, 和 c 的值。
 ************************************************************************/

#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

int main() {
	// 字符数组用于存储字符串数据，s 数组中的内容将用于解析。
	char s[100] = "123 456 789"; // 声明并初始化一个字符数组 s，字符长度为100。数组 s 初始化为字符串 "123 456 789"。
	int a, b, c; // 声明三个整型变量 a, b, 和 c，用于存储从字符串 s 中解析出的整数。
	// sscanf 函数用于从字符串 s 中读取格式化数据，并将其存储到变量 a, b, 和 c 中。
	sscanf(s, "%d%d%d", &a, &b, &c); // "%d%d%d" 指定 sscanf 从字符串 s 中读取三个整数，分别存储在 a, b, 和 c 中。& 符号表示取变量的地址.
	printf("a = %d, b = %d, c = %d\n", a, b, c);
	return 0;
}
