/*************************************************************************
	> 题目描述:
	如果一个数既是7的倍数又不能被2整除，那么我们称之为7的奇倍数
	输入一个正整数n，判断它是否是7的奇倍数

	> 输入 :
	输入两个整数n (0 <= n <= 100)

	> 输出 :
	如果n是7的奇倍数，输出YES, 否则输出NO

	> 条件判断 :
	if (condition) statement1; else statement2; 形式。
	&& 是逻辑与运算符，连接两个条件表达式，只有当两个条件都为真时，整个表达式才为真。

 ************************************************************************/

#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

int main() {
	int n;
	scanf("%d", &n);
	if (n % 7 == 0 && n % 2 != 0) {
		printf("YES\n");
	}
	else {
		printf("No\n");
	}
	return 0;
}
