/*************************************************************************
题目描述
​ 编程求𝑛阶乘的值，𝑛!= 1×2×3×…×(n−1)×n

输入
一行一个正整数，1≤n≤20

输出
 一行一个正整数，表示n!

样例输入
5

样例输出
120
 ************************************************************************/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h> 

long long f(int n) { // long long 用于表示较大的整数值，适合计算大数阶乘。
	if (n == 1) return 1; // 阶乘计算的基准情况，1! = 1
	return n * f(n - 1); // n! = n * (n-1)!
}

int main() {
	int n;
	scanf("%d", &n);
	printf("%lld\n", f(n)); //"%lld" 是格式说明符，表示输出 long long 类型的整数。
	return 0;
}
